In [1]:
import pandas as pd
import numpy as np

In [2]:
city_temp = pd.read_csv(r"C:\Users\amyc0\OneDrive\Documents\ECO225\archive\GlobalLandTemperaturesByCity.csv")
state_temp = pd.read_csv(r"C:\Users\amyc0\OneDrive\Documents\ECO225\archive\GlobalLandTemperaturesByState.csv")
country_temp = pd.read_csv(r"C:\Users\amyc0\OneDrive\Documents\ECO225\archive\GlobalLandTemperaturesByCountry.csv")

In [3]:
city_temp

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
...,...,...,...,...,...,...,...
8599207,2013-05-01,11.464,0.236,Zwolle,Netherlands,52.24N,5.26E
8599208,2013-06-01,15.043,0.261,Zwolle,Netherlands,52.24N,5.26E
8599209,2013-07-01,18.775,0.193,Zwolle,Netherlands,52.24N,5.26E
8599210,2013-08-01,18.025,0.298,Zwolle,Netherlands,52.24N,5.26E
8599211,2013-09-01,NaN,NaN,Zwolle,Netherlands,52.24N,5.26E